# UIView Properties

---
The UIView type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| ViewId|  The id of the View associated with a UIView.
Top
#### Reference
UIView Class
Autodesk.Revit.UI Namespace